package org._jd;

//TIP To <b>Run</b> code, press <shortcut actionId="Run"/> or
// click the <icon src="AllIcons.Actions.Execute"/> icon in the gutter.
public class Main {
    public static void main(String[] args) {
        /*
        1)  Почему использование тестовых заглушек может быть полезным при написании модульных тестов?

            Потому что модульное тестирование предполагает наличие внещних зависимостей, которые могут повлиять на
            поведение тестируемого кода или нежелательно дергать внешний API/БД/etc.

        2) Какой тип тестовой заглушки следует использовать, если вам нужно проверить, что метод был вызван с
           определенными аргументами?

            Spy.

        3) Какой тип тестовой заглушки следует использовать, если вам просто нужно вернуть определенное значение
           или исключение в ответ на вызов метода?

            Stub.

        4) Какой тип тестовой заглушки вы бы использовали для имитации  взаимодействия с внешним API или базой
           данных?

            Mock.

         */

    }
}